group-reports/shahriar-3-1-tests/resluts/disk-throughput-tuning-protocol-B/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=16369: Thu Jul 13 17:49:47 2023
   read: IOPS=5, BW=22.9MiB/s (24.0MB/s)(13.5GiB/602693msec)
    slat (usec): min=53, max=1547, avg=96.42, stdev=62.62
    clat (msec): min=36, max=5240, avg=2794.19, stdev=155.10
     lat (msec): min=37, max=5240, avg=2794.29, stdev=155.06
    clat percentiles (msec):
     |  1.00th=[ 2668],  5.00th=[ 2735], 10.00th=[ 2769], 20.00th=[ 2769],
     | 30.00th=[ 2802], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2802], 80.00th=[ 2802], 90.00th=[ 2836], 95.00th=[ 2836],
     | 99.00th=[ 2937], 99.50th=[ 3004], 99.90th=[ 4732], 99.95th=[ 5067],
     | 99.99th=[ 5269]
   bw (  KiB/s): min= 8175, max=40960, per=99.91%, avg=23424.57, stdev=3479.04, samples=1201
   iops        : min=    1, max=   10, avg= 5.60, stdev= 0.91, samples=1201
  lat (msec)   : 50=0.03%, 100=0.03%, 500=0.06%, 750=0.03%, 1000=0.06%
  cpu          : usr=0.02%, sys=0.07%, ctx=3452, majf=0, minf=45
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3450,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=22.9MiB/s (24.0MB/s), 22.9MiB/s-22.9MiB/s (24.0MB/s-24.0MB/s), io=13.5GiB (14.5GB), run=602693-602693msec

Disk stats (read/write):
    drbd1: ios=17250/6, merge=0/0, ticks=48064510/72, in_queue=48064582, util=99.96%, aggrios=17250/9, aggrmerge=0/0, aggrticks=48092429/66, aggrin_queue=48092495, aggrutil=99.98%
    dm-0: ios=17250/9, merge=0/0, ticks=48092429/66, in_queue=48092495, util=99.98%, aggrios=17250/9, aggrmerge=0/0, aggrticks=48092902/67, aggrin_queue=48084413, aggrutil=99.99%
  vdb: ios=17250/9, merge=0/0, ticks=48092902/67, in_queue=48084413, util=99.99%